Curso/Modulo-03/crypto_wallet/app/controllers/coins_controller.rb

SELECT "coins".* FROM "coins"
---
  def index
    @coins = Coin.all

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "updated_at" = ?, "mining_type_id" = ? WHERE "coins"."id" = ?  [["updated_at", "2023-05-31 18:35:27.080352"], ["mining_type_id", 2], ["id", 1]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 3]]
---
  def destroy
    @coin.destroy

SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"
---
    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description,:id)

SELECT "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_coin
      @coin = Coin.find(params[:id])