Curso2/tdd_app/app/controllers/customers_controller.rb

UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "alexandre toma"], ["updated_at", "2023-06-29 18:41:40.061713"], ["id", 1]]
---
  def update
    if @customer.update(params_customer)

INSERT INTO "customers" ("name", "email", "smoker", "phone", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(params_customer)

    if @customer.save