Curso/pratica-solo/petzinho/app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners"
---
  def index
    @owners = Owner.all