Curso/pratica-solo/petzinho/app/controllers/pets_controller.rb

  def index
    @pets = Pet.all
---
SELECT "pets".* FROM "pets"

  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save
---
INSERT INTO "pets" ("description", "race", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Laika"], ["race", "Vira-lata"], ["created_at", "2023-06-02 17:10:20.454971"], ["updated_at", "2023-06-02 17:10:20.454971"]]

  def destroy
    @pet.destroy
---
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 2]]

    def set_pet
      @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]