Curso3/notebook-api/app/controllers/contacts_controller.rb

    def index
      page_number = params[:page].try(:[], :number)
      per_page = params[:page].try(:[], :size)

      @contacts = Contact.all.page(page_number).per(per_page)
---
SELECT "contacts".* FROM "contacts" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) AS "size", MAX(subquery_for_cache_key.collection_cache_key_timestamp) AS timestamp FROM (SELECT "contacts"."updated_at" AS collection_cache_key_timestamp FROM "contacts" LIMIT ? OFFSET ?) subquery_for_cache_key  [["LIMIT", 5], ["OFFSET", 0]]

    def create
      @contact = Contact.new(contact_params)

      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MyString"], ["email", "MyString"], ["birthdate", "2023-06-30"], ["created_at", "2023-06-30 16:58:40.823509"], ["updated_at", "2023-06-30 16:58:40.823509"]]

    def destroy
      @contact.destroy
---
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 980190962]]

      def set_contact
        @contact = Contact.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]