Curso2/teste_app/app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("description", "email", "vip", "days_to_pay", "gender", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE "customers" SET "description" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["description", "Tasha Luettgen- Atualizado"], ["updated_at", "2023-06-27 17:48:01.661285"], ["id", 1]]

  def destroy
    @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]