Curso/pratica-solo/petzinho/lib/tasks/dev.rake

task pet_add: :environment do
  show_spinner("registering Pets...") do
    pets=[
      {
        description: 'Laika',
        race: 'viralata'
      }
    ]
    pets.each do |pet|
      sleep(1)
        Pet.find_or_create_by!(pet)
---
INSERT INTO "pets" ("description", "race", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Laika"], ["race", "viralata"], ["created_at", "2023-06-02 20:54:22.909220"], ["updated_at", "2023-06-02 20:54:22.909220"]]

  task owner_add: :environment do
    show_spinner("registering owner...") do
      owners=[
        {
          description: 'Alexandre',
        }
      ]
      owners.each do |owner|
        sleep(1)
          Owner.find_or_create_by!(owner)
---
INSERT INTO "owners" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Alexandre"], ["created_at", "2023-06-02 20:54:25.457586"], ["updated_at", "2023-06-02 20:54:25.457586"]]